/* brew bundle で実行。事前にAppStoreにログインが必須 */
cask_args appdir: "/Applications"

brew "curl"
brew "fzf"
brew "git"
brew "tig"
brew "anyenv"
brew "tree"
brew "ripgrep"
brew "bat"
brew "direnv"
brew "asdf"
brew "yarn"
brew "gibo"
brew "gh"
brew "ghq"
brew "peco"
brew "graphviz"
brew "kustomize"
brew "jq"

cask "1password"
cask "bettertouchtool"
cask "docker"
cask "google-chrome"
cask "google-japanese-ime"
cask "iterm2"
cask "visual-studio-code"
cask "karabiner-elements"
cask "deepl"
cask "clipy"
cask "altair-graphql-client"
cask "adoptopenjdk" /* PlantUML用にインストール */
cask "dbeaver-community"

/* terraform pacakge */
tap "hashicorp/tap"
brew "hashicorp/tap/terraform"

mas "BetterSnapTool", id: 417375580
mas "Slack", id: 803453959

