cask_args appdir: "/Applications"

brew "curl"
brew "fzf"
brew "git"
brew "tig"
brew "anyenv"
brew "tree"
brew "ripgrep"
brew "bat"
brew "direnv"
brew "asdf"
brew "yarn"
brew "gibo"
brew "gh"
brew "ghq"
brew "peco"
brew "graphviz"
brew "kustomize"
brew "jq"
brew "docker-compose"
brew "comby"
brew "lazygit"
brew "tilt"
brew "yq"
brew "google-cloud-sdk"

cask "1password"
cask "bettertouchtool"
cask "docker"
cask "google-chrome"
cask "google-japanese-ime"
cask "visual-studio-code"
cask "karabiner-elements"
cask "deepl"
cask "clipy"
cask "altair-graphql-client"
cask "adoptopenjdk"
cask "dbeaver-community"
cask "slack"
cask "raycast"
cask "keycastr"
cask "warp"

tap "hashicorp/tap"
brew "hashicorp/tap/terraform"

